In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,1,4,5], 'B':[1,2,4,5,6], 'C':[3,4,3,6,7]})
df

   A  B  C
0  1  1  3
1  2  2  4
2  1  4  3
3  4  5  6
4  5  6  7

In [3]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [4]:
df.duplicated(subset=['A','C'])

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [5]:
cond = df.duplicated(subset=['A','C'])
cond

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [6]:
df[cond]

   A  B  C
2  1  4  3

In [7]:
df[~cond]

   A  B  C
0  1  1  3
1  2  2  4
3  4  5  6
4  5  6  7

In [8]:
df

   A  B  C
0  1  1  3
1  2  2  4
2  1  4  3
3  4  5  6
4  5  6  7

In [9]:
df.drop_duplicates(subset=['A','C'], keep='first')

   A  B  C
0  1  1  3
1  2  2  4
3  4  5  6
4  5  6  7

In [10]:
df.drop_duplicates(subset=['A','C'], keep='last')

   A  B  C
1  2  2  4
2  1  4  3
3  4  5  6
4  5  6  7

In [11]:
df.drop_duplicates(subset=['A','C'], keep=False)

   A  B  C
1  2  2  4
3  4  5  6
4  5  6  7

In [12]:
df = pd.DataFrame({'A':[1,2,1,4,5], 'B':[1,2,4,5,6], 'C':[3,4,3,6,7]})
df

   A  B  C
0  1  1  3
1  2  2  4
2  1  4  3
3  4  5  6
4  5  6  7

In [15]:
df = df.drop_duplicates(subset=['A','C'], keep='first')

In [16]:
df

   A  B  C
0  1  1  3
1  2  2  4
3  4  5  6
4  5  6  7

In [17]:
df = pd.DataFrame({'A':[1,2,1,4,5], 'B':[1,2,4,5,6], 'C':[3,4,3,6,7]})
df

   A  B  C
0  1  1  3
1  2  2  4
2  1  4  3
3  4  5  6
4  5  6  7

In [18]:
df.drop_duplicates(subset=['A','C'], keep='first', inplace=True)

In [19]:
df

   A  B  C
0  1  1  3
1  2  2  4
3  4  5  6
4  5  6  7